# Advanced Dataframes Exercises

## Exercises 1

### Create a function named get_db_url. 
It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [2]:
import pandas as pd
import numpy as np

In [3]:
from env import host, user, password

In [4]:
def get_db_url(host, user, password, database):
        
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    return url

In [6]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url(host,user, password, 'employees'))

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [7]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url(host,user, password, 'employees'))

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

### Read the employees and titles tables into two separate DataFrames.

In [8]:
employees = pd.read_sql('SELECT * FROM employees', get_db_url(host,user, password, 'employees'))

In [9]:
type(employees)

pandas.core.frame.DataFrame

In [10]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [11]:
titles = pd.read_sql('SELECT * FROM titles', get_db_url(host,user, password, 'employees'))

In [12]:
type(titles)

pandas.core.frame.DataFrame

In [13]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [14]:
employees.shape

(300024, 6)

In [15]:
titles.shape

(443308, 4)

### Display the summary statistics for each DataFrame.

In [16]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [17]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

### How many unique titles are in the titles DataFrame?

In [18]:
unique_values =  pd.unique(titles['title'])

print(unique_values, len(unique_values))

['Senior Engineer' 'Staff' 'Engineer' 'Senior Staff' 'Assistant Engineer'
 'Technique Leader' 'Manager'] 7

In [19]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [20]:
len(titles.title.value_counts())

7

### What is the oldest date in the to_date column?

In [21]:
titles.to_date.min()

#titles['to_date'] = pd.to_datetime(titles['to_date'], format='%Y-%m-%d')

datetime.date(1985, 3, 1)

In [22]:
titles.to_date.sort_values(ascending=True).head(1)

16064    1985-03-01
Name: to_date, dtype: object

### What is the most recent date in the to_date column?

In [23]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [24]:
titles.to_date.sort_values(ascending=False).head(1)

0    9999-01-01
Name: to_date, dtype: object

In [25]:
titles.sort_values(by = 'to_date').tail(1)

        emp_no     title   from_date     to_date
443307  499999  Engineer  1997-11-30  9999-01-01

# Exercises II

### Copy the users and roles DataFrames from the examples above.

In [26]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [27]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

### What is the result of using a right join on the DataFrames?

In [28]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='right')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role
0  1.0      bob        1      admin
1  2.0      joe        2     author
2  3.0    sally        3   reviewer
3  4.0     adam        3   reviewer
4  NaN      NaN        4  commenter

### 3.  What is the result of using an outer join on the DataFrames?

In [29]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id  role_id       role
0  1.0      bob      1.0      1.0      admin
1  2.0      joe      2.0      2.0     author
2  3.0    sally      3.0      3.0   reviewer
3  4.0     adam      3.0      3.0   reviewer
4  5.0     jane      NaN      NaN        NaN
5  6.0     mike      NaN      NaN        NaN
6  NaN      NaN      NaN      4.0  commenter

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [30]:
(users.merge(roles, 
             how='outer')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

### 5. Load the mpg dataset from PyDataset.

In [31]:
from pydataset import data

# data('mpg', show_doc=True) # view the documentation for the dataset
mpg = data('mpg') # load the dataset and store it in a variable

### 6. Output and read the documentation for the mpg dataset.

In [32]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

### 7. How many rows and columns are in the dataset?

In [33]:
mpg.shape

(234, 11)

### 8. Check out your column names and perform any cleanup you may want on them.

In [34]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [35]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [60]:
mpg = mpg.rename(columns={'cty': 'city',
                          'hwy': 'highway',
                         'class': 'vehicle_type',
                         'fl':"fuel_type"})
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fuel_type,vehicle_type,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

### 9. Display the summary statistics for the dataset.

In [37]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [38]:
mpg.describe()

            displ         year         cyl        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

### 10. How many different manufacturers are there?

In [39]:
mpg.manufacturer.value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
mercury        4
land rover     4
lincoln        3
Name: manufacturer, dtype: int64

In [61]:
mpg.manufacturer.unique().size

15

In [62]:
mpg.manufacturer.nunique()

15

In [40]:
len(mpg.manufacturer.value_counts())

15

### 11. How many different models are there?

In [41]:
mpg.model.value_counts()

caravan 2wd               11
ram 1500 pickup 4wd       10
dakota pickup 4wd          9
mustang                    9
jetta                      9
civic                      9
grand cherokee 4wd         8
impreza awd                8
a4 quattro                 8
sonata                     7
camry solara               7
toyota tacoma 4wd          7
durango 4wd                7
f150 pickup 4wd            7
passat                     7
tiburon                    7
a4                         7
camry                      7
explorer 4wd               6
new beetle                 6
forester awd               6
altima                     6
4runner 4wd                6
gti                        5
corvette                   5
corolla                    5
grand prix                 5
c1500 suburban 2wd         5
malibu                     5
mountaineer 4wd            4
range rover                4
pathfinder 4wd             4
k1500 tahoe 4wd            4
expedition 2wd             3
maxima                     3
a6 quattro                 3
navigator 2wd              3
land cruiser wagon 4wd     2
Name: model, dtype: int64

In [42]:
len(mpg.model.value_counts())

38

In [63]:
mpg.model.nunique()

38

### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [43]:
mpg["mileage_difference"] = mpg.highway - mpg.city

In [44]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [45]:
mpg['average_mileage'] = (mpg.city + mpg.highway) / 2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [46]:
mpg['is_automatic'] = mpg.trans.str.startswith('auto')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [56]:
best_miles_per_gallon = mpg.average_mileage.max()
best_miles_per_gallon

mpg.sort_values(by='average_mileage', ascending = False).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False

In [68]:
manufacturer_avg_mileage = mpg.groupby("manufacturer").average_mileage.mean()

manufacturer_avg_mileage.idxmax()

'honda'

In [69]:
manufacturer_avg_mileage.sort_values(ascending = False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

### 16. Do automatic or manual cars have better miles per gallon?

In [70]:
mpg.groupby('is_automatic').average_mileage.agg(['mean'])

                   mean
is_automatic
False         22.227273
True          19.130573

# Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [76]:
pd.read_sql('SELECT * FROM orders LIMIT 5 OFFSET 50', get_db_url(host,user, password, 'chipotle'))

,id,order_id,quantity,item_name,choice_description,item_price
0,51,23,1,Steak Burrito,"[Roasted Chili Corn Salsa (Medium), [Rice, Fajita Veggies, Cheese, Sour Cream, Lettuce]]",$8.99
1,52,23,2,Canned Soda,[Mountain Dew],$2.18
2,53,24,1,Chicken Burrito,"[Roasted Chili Corn Salsa (Medium), [Black Beans, Rice, Fajita Veggies, Cheese, Sour C...",$10.98
3,54,24,1,Canned Soda,[Sprite],$1.09
4,55,25,1,Steak Bowl,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice, Fajita Veggies, Cheese, Sour Cream]]",$8.99

### 2. What is the total price for each order?

In [77]:
orders = pd.read_sql('SELECT * FROM orders', get_db_url(host,user, password, 'chipotle'))

In [78]:
type(orders)

pandas.core.frame.DataFrame

In [79]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

In [80]:
orders.describe()

                id     order_id     quantity
count  4622.000000  4622.000000  4622.000000
mean   2311.500000   927.254868     1.075725
std    1334.400802   528.890796     0.410186
min       1.000000     1.000000     1.000000
25%    1156.250000   477.250000     1.000000
50%    2311.500000   926.000000     1.000000
75%    3466.750000  1393.000000     1.000000
max    4622.000000  1834.000000    15.000000

In [179]:
item_price = orders.item_price.str.replace("$", "").astype(float)
type(item_price)

In [150]:
orders.groupby('order_id').item_price.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [182]:
orders

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",8.75

### 3. What are the most popular 3 items?

In [115]:
pd.crosstab(orders.item_name, orders.quantity.sum())

col_0                                  4972
item_name
6 Pack Soft Drink                        54
Barbacoa Bowl                            66
Barbacoa Burrito                         91
Barbacoa Crispy Tacos                    11
Barbacoa Salad Bowl                      10
Barbacoa Soft Tacos                      25
Bottled Water                           162
Bowl                                      2
Burrito                                   6
Canned Soda                             104
Canned Soft Drink                       301
Carnitas Bowl                            68
Carnitas Burrito                         59
Carnitas Crispy Tacos                     7
Carnitas Salad                            1
Carnitas Salad Bowl                       6
Carnitas Soft Tacos                      40
Chicken Bowl                            726
Chicken Burrito                         553
Chicken Crispy Tacos                     47
Chicken Salad                             9
Chicken Salad Bowl                      110
Chicken Soft Tacos                      115
Chips                                   211
Chips and Fresh Tomato Salsa            110
Chips and Guacamole                     479
Chips and Mild Fresh Tomato Salsa         1
Chips and Roasted Chili Corn Salsa       22
Chips and Roasted Chili-Corn Salsa       18
Chips and Tomatillo Green Chili Salsa    43
Chips and Tomatillo Red Chili Salsa      48
Chips and Tomatillo-Green Chili Salsa    31
Chips and Tomatillo-Red Chili Salsa      20
Crispy Tacos                              2
Izze                                     20
Nantucket Nectar                         27
Salad                                     2
Side of Chips                           101
Steak Bowl                              211
Steak Burrito                           368
Steak Crispy Tacos                       35
Steak Salad                               4
Steak Salad Bowl                         29
Steak Soft Tacos                         55
Veggie Bowl                              85
Veggie Burrito                           95
Veggie Crispy Tacos                       1
Veggie Salad                              6
Veggie Salad Bowl                        18
Veggie Soft Tacos                         7

In [125]:
num_item_ordered = orders.groupby('item_name').quantity.agg(['sum'])
num_item_ordered.nlargest(3, 'sum')

                     sum
item_name
Chicken Bowl         761
Chicken Burrito      591
Chips and Guacamole  506

### 4. Which item has produced the most revenue?

In [160]:
num_item_ordered.rename(columns = {'item_name':'item_name','sum':'total'}, inplace = True)
num_item_ordered

                                       total
item_name
6 Pack Soft Drink                         55
Barbacoa Bowl                             66
Barbacoa Burrito                          91
Barbacoa Crispy Tacos                     12
Barbacoa Salad Bowl                       10
Barbacoa Soft Tacos                       25
Bottled Water                            211
Bowl                                       4
Burrito                                    6
Canned Soda                              126
Canned Soft Drink                        351
Carnitas Bowl                             71
Carnitas Burrito                          60
Carnitas Crispy Tacos                      8
Carnitas Salad                             1
Carnitas Salad Bowl                        6
Carnitas Soft Tacos                       40
Chicken Bowl                             761
Chicken Burrito                          591
Chicken Crispy Tacos                      50
Chicken Salad                              9
Chicken Salad Bowl                       123
Chicken Soft Tacos                       120
Chips                                    230
Chips and Fresh Tomato Salsa             130
Chips and Guacamole                      506
Chips and Mild Fresh Tomato Salsa          1
Chips and Roasted Chili Corn Salsa        23
Chips and Roasted Chili-Corn Salsa        18
Chips and Tomatillo Green Chili Salsa     45
Chips and Tomatillo Red Chili Salsa       50
Chips and Tomatillo-Green Chili Salsa     33
Chips and Tomatillo-Red Chili Salsa       25
Crispy Tacos                               2
Izze                                      20
Nantucket Nectar                          29
Salad                                      2
Side of Chips                            110
Steak Bowl                               221
Steak Burrito                            386
Steak Crispy Tacos                        36
Steak Salad                                4
Steak Salad Bowl                          31
Steak Soft Tacos                          56
Veggie Bowl                               87
Veggie Burrito                            97
Veggie Crispy Tacos                        1
Veggie Salad                               6
Veggie Salad Bowl                         18
Veggie Soft Tacos                          8

In [174]:
item_revenue = num_item_ordered.total * orders.item_price
type(item_revenue)

pandas.core.series.Series

In [184]:
orders.groupby('item_name').item_price.sum().sort_values(ascending = False).head()

item_name
Chicken Bowl           7342.73
Chicken Burrito        5575.82
Steak Burrito          3851.43
Steak Bowl             2260.19
Chips and Guacamole    2201.04
Name: item_price, dtype: float64

### 5. Join the employees and titles DataFrames together.

In [178]:
concat_df1 = pd.concat([employees, titles])
concat_df1

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,NaN,NaN,NaN
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,NaN,NaN,NaN
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,NaN,NaN,NaN
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,NaN,NaN,NaN
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
443303,499997,NaN,NaN,NaN,NaN,NaN,Engineer,1987-08-30,1992-08-29
443304,499997,NaN,NaN,NaN,NaN,NaN,Senior Engineer,1992-08-29,9999-01-01
443305,499998,NaN,NaN,NaN,NaN,NaN,Senior Staff,1998-12-27,9999-01-01
443306,499998,NaN,NaN,NaN,NaN,NaN,Staff,1993-12-27,1998-12-27
443307,499999,NaN,NaN,NaN,NaN,NaN,Engineer,1997-11-30,9999-01-01

In [185]:
employee_titles = pd.merge(employees, titles, left_on='emp_no', right_on='emp_no', how='inner')
employee_titles

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

### 6. For each title, find the hire date of the employee that was hired most recently with that title

In [187]:
employee_titles.groupby(by = 'title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [190]:
df = pd.read_sql('SELECT * FROM employees JOIN titles USING(emp_no) JOIN dept_emp USING(emp_no) JOIN departments USING(dept_no)', get_db_url(host,user, password, 'employees'))
df

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,from_date,to_date,dept_name
0,d009,10011,1953-11-07,Mary,Sluis,F,1990-01-22,Staff,1990-01-22,1996-11-09,1990-01-22,1996-11-09,Customer Service
1,d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,Senior Staff,1996-09-20,9999-01-01,1989-09-20,9999-01-01,Customer Service
2,d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,Staff,1989-09-20,1996-09-20,1989-09-20,9999-01-01,Customer Service
3,d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,Senior Staff,2000-05-04,9999-01-01,1992-05-04,9999-01-01,Customer Service
4,d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,Staff,1992-05-04,2000-05-04,1992-05-04,9999-01-01,Customer Service
...,...,...,...,...,...,...,...,...,...,...,...,...,...
489898,d007,499986,1952-07-22,Nathan,Ranta,F,1985-08-11,Senior Staff,1992-08-11,9999-01-01,1985-08-11,9999-01-01,Sales
489899,d007,499986,1952-07-22,Nathan,Ranta,F,1985-08-11,Staff,1985-08-11,1992-08-11,1985-08-11,9999-01-01,Sales
489900,d007,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,Staff,1999-12-21,9999-01-01,1999-12-21,9999-01-01,Sales
489901,d007,499988,1962-09-28,Bangqing,Kleiser,F,1986-06-06,Senior Staff,1997-07-25,2001-10-09,1988-07-25,2001-10-09,Sales
489902,d007,499988,1962-09-28,Bangqing,Kleiser,F,1986-06-06,Staff,1988-07-25,1997-07-25,1988-07-25,2001-10-09,Sales

In [191]:
pd.crosstab(df.title, df.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,298,7769,0,0,0,6445,1831,378,0
Engineer,2362,58135,0,0,0,49649,13852,2986,0
Manager,4,2,2,2,2,4,4,2,2
Senior Engineer,2027,49326,0,0,0,42205,11864,2570,0
Senior Staff,13925,1247,12139,12274,13940,1270,0,11637,36191
Staff,16150,1424,13929,14342,16196,1478,0,13495,41808
Technique Leader,309,7683,0,0,0,6557,1795,393,0